tap "homebrew/services"
brew "bitcoin", restart_service: true
brew "curl" 
brew "fd"
brew "eza"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-delta"
brew "howdoi"
brew "htop"
brew "imagemagick"
brew "just"
brew "jq" 
brew "lazygit"
brew "neomutt"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "ollama"
brew "postgresql@15", restart_service: :changed
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "rustup-init" 
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
cask "alacritty"
cask "appcleaner"
cask "blender"
cask "blockblock"
cask "brave-browser"
cask "burp-suite"
cask "calibre"
cask "discord"
cask "docker"
cask "dnsmonitor"
cask "element"
cask "figma"
cask "firefox"
cask "gimp"
cask "gpg-suite"
cask "google-chrome"
cask "halloy"
cask "iina"
cask "iterm2"
cask "keepassxc"
cask "knockknock"
cask "libreoffice"
cask "lulu"
cask "mullvad-browser"
cask "netiquette"
cask "netnewswire"
cask "obsidian"
cask "oversight"
cask "pgadmin4"
cask "processing"
cask "rapidapi"
cask "reikey"
cask "signal"
cask "soulseek"
cask "sparrow"
cask "spotify"
cask "tor-browser"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "wireguard-tools"
cask "wireshark"
vscode "apollographql.vscode-apollo"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "github.github-vscode-theme"
vscode "humao.rest-client"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "luke-zhang-04.processing-vscode"
vscode "mquandalle.graphql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "nomicfoundation.hardhat-solidity"
vscode "orsenkucher.vscode-graphql"
vscode "redhat.vscode-xml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "slevesque.shader"
vscode "tobiah.language-pde"
vscode "vue.volar"
vscode "wholroyd.jinja"